In [3]:
import csv
from pathlib import Path
import numpy as np
import pandas as pd

In [4]:
menu_filepath = Path('Resources/menu_data.csv')
sales_filepath = Path('Resources/sales_data.csv')

In [16]:
df_menu = pd.read_csv(menu_filepath)
df_sales = pd.read_csv(sales_filepath)

In [17]:
report = {'01-count':0 ,'02-revenue':0, '03-cogs': 0, '04-profit':0}

In [20]:
df_sales.Menu_Item.str.contains('ramen')

0         True
1         True
2         True
3         True
4         True
         ...
74119     True
74120    False
74121    False
74122     True
74123     True
Name: Menu_Item, Length: 74124, dtype: bool

In [19]:
df_sales

,Line_Item_ID,Date,Credit_Card_Number,Quantity,Menu_Item
0,1,01-01-2017,7437926611570799,1,spicy miso ramen
1,2,01-01-2017,7437926611570799,1,spicy miso ramen
2,3,01-01-2017,8421920068932819,3,tori paitan ramen
3,4,01-01-2017,8421920068932819,3,tori paitan ramen
4,5,01-01-2017,4787310681569648,1,truffle butter ramen
...,...,...,...,...,...
74119,74120,12-31-2018,1697055332228941,4,tonkotsu ramen
74120,74121,12-31-2018,6800009643487106,1,vegetarian spicy miso
74121,74122,12-31-2018,6800009643487106,1,vegetarian spicy miso
74122,74123,12-31-2018,5981057609583653,2,spicy miso ramen
74123,74124,12-31-2018,5981057609583653,2,spicy miso ramen